# математические операторы

# сложение
a = 5
a = a + 10 # обычное сложение
a += 10 # сокращенная запись
print(f"Сложение: {a}")

# вычитание
a = 15
a = a - 10 # обычное сложение
a -= 10 # сокращенная запись
print(f"Вычитание: {a}")

# умножение
a = 2
a = a * 3 # обычное сложение
a *= 3 # сокращенная запись
print(f"Умножение: {a}")

# деление
a = 5
a = a / 2 # обычное
a /= 2 # сокращенная запись
print(f"Деление: {a}")

# целочисленное деление
a = 5
a = a // 2 # обычное
a //= 2 # сокращенная запись
print(f"Целочисленное деление: {a}")

# остаток от деления
a = 5
a = a % 2 # обычное
a %= 2 # сокращенная запись
print(f"Остаток от деления: {a}")

# степень
a = 5
a = a ** 3 # обычное
a **= 3 # сокращенная запись
print(f"Степень: {a}")

# модуль
a = abs(-5) # обычное
print(f"Модуль: {a}")

# ошибки
# на 0 делить нельзя
# print(10 / 0)
# несовместимые типы данных
# print(1 + '1')

# проблемы с точностью
print(0.1 + 0.2)
print(0.1 * 10)
print(0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1)